# Pandas
Topics covered:
- filtering
- groupby

In [2]:
import pandas as pd
import seaborn as sns

import warnings

# Suppress all FutureWarnings
warnings.simplefilter(action='ignore', category=FutureWarning)

### filtering

In [25]:
# Load the Titanic dataset
df = sns.load_dataset('titanic')
print(df.head())

# 1. Passengers who are female and survived
female_survivors = df[(df['sex'] == 'female') & (df['survived'] == 1)]
print("\nFemale survivors:")
print(female_survivors.head())
print("11111111111111111111111111")


# 2. Passengers who are either in first class OR over 60 years old
first_class_or_elderly = df[(df['pclass'] == 1) | (df['age'] > 60)]
print("\nFirst class or elderly passengers:")
print(first_class_or_elderly.head())
print("22222222222222222222222222")

# 3. Male passengers under 18 who did not survive
young_male_non_survivors = df[(df['sex'] == 'male') & (df['age'] < 18) & (df['survived'] == 0)]
print("\nYoung male non-survivors:")
print(young_male_non_survivors.head())
print("3333333333333333333333333333333333")

# 4. Females in 2nd or 3rd class
female_in_2nd_3rd = df[(df['sex'] == 'female') & ((df['pclass'] == 2) | (df['pclass'] == 3))]
print("\nFemales in 2nd or 3rd class:")
print(female_in_2nd_3rd.head())
print("44444444444444444444444444")

# 5. Passengers with missing age or fare > 200
missing_age_or_expensive_fare = df[(df['age'].isnull()) | (df['fare'] > 200)]
print("\nPassengers with missing age or fare > 200:")
print(missing_age_or_expensive_fare.head())
print("555555555555555555555555555")

   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True

Female survivors:
   survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
1         1       1  female  38.0      1      0  71.2833        C   First
2         1       3  female  26.0      0      0   7.9250        S   Third
3         1       1  female  35.0      1      0  53.1000        S   First
8         1       3  female  27.0      0      2  11.1333        S   Third
9         1       2  female  14.0      1      0  30.0708        C  Second

     who  adult_male deck  embark_town alive  alone
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
8  woman       False  NaN  Southampton   yes  False
9  child       False  NaN    Cherbourg   yes  False
11111111111111111111111111

First class or elderly passengers:
    survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
1          1       1  female  38.0      1      0  71.2833        C  First
3          1       1  female  35.0      1      0  53.1000        S  First
6          0       1    male  54.0      0      0  51.8625        S  First
11         1       1  female  58.0      0      0  26.5500        S  First
23         1       1    male  28.0      0      0  35.5000        S  First

      who  adult_male deck  embark_town alive  alone
1   woman       False    C    Cherbourg   yes  False
3   woman       False    C  Southampton   yes  False
6     man        True    E  Southampton    no   True
11  woman       False    C  Southampton   yes   True
23    man        True    A  Southampton   yes   True
22222222222222222222222222

Young male non-survivors:
    survived  pclass   sex   age  sibsp  parch     fare embarked  class  \
7          0       3  male   2.0      3      1  21.0750        S  Third
16         0       3  male   2.0      4      1  29.1250        Q  Third
50         0       3  male   7.0      4      1  39.6875        S  Third
59         0       3  male  11.0      5      2  46.9000        S  Third
63         0       3  male   4.0      3      2  27.9000        S  Third

      who  adult_male deck  embark_town alive  alone
7   child       False  NaN  Southampton    no  False
16  child       False  NaN   Queenstown    no  False
50  child       False  NaN  Southampton    no  False
59  child       False  NaN  Southampton    no  False
63  child       False  NaN  Southampton    no  False
3333333333333333333333333333333333

Females in 2nd or 3rd class:
    survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
2          1       3  female  26.0      0      0   7.9250        S   Third
8          1       3  female  27.0      0      2  11.1333        S   Third
9          1       2  female  14.0      1      0  30.0708        C  Second
10         1       3  female   4.0      1      1  16.7000        S   Third
14         0       3  female  14.0      0      0   7.8542        S   Third

      who  adult_male deck  embark_town alive  alone
2   woman       False  NaN  Southampton   yes   True
8   woman       False  NaN  Southampton   yes  False
9   child       False  NaN    Cherbourg   yes  False
10  child       False    G  Southampton   yes  False
14  child       False  NaN  Southampton    no   True
44444444444444444444444444

Passengers with missing age or fare > 200:
    survived  pclass     sex   age  sibsp  parch      fare embarked   class  \
5          0       3    male   NaN      0      0    8.4583        Q   Third
17         1       2    male   NaN      0      0   13.0000        S  Second
19         1       3  female   NaN      0      0    7.2250        C   Third
26         0       3    male   NaN      0      0    7.2250        C   Third
27         0       1    male  19.0      3      2  263.0000        S   First

      who  adult_male deck  embark_town alive  alone
5     man        True  NaN   Queenstown    no   True
17    man        True  NaN  Southampton   yes   True
19  woman       False  NaN    Cherbourg   yes   True
26    man        True  NaN    Cherbourg    no   True
27    man        True    C  Southampton    no  False
555555555555555555555555555

In [26]:
# tips_filtering_examples.py

# Load the tips dataset
df = sns.load_dataset("tips")
print(df.head(10))
print("0000000000000000000000000")

# 1. Filter: Customers who tipped more than 20% of their total bill
df['tip_percent'] = (df['tip'] / df['total_bill']) * 100
generous_tippers = df[df['tip_percent'] > 20]
print("\n1. Tipped more than 20% of total bill:")
print(generous_tippers.head())
print("111111111111111111111111111")

# 2. Filter: Lunch time male customers with total bill between $15 and $30
lunch_males = df[(df['time'] == 'Lunch') & (df['sex'] == 'Male') & (df['total_bill'].between(15, 30))]
print("\n2. Lunch time male customers with total bill between $15 and $30:")
print(lunch_males.head())
print("2222222222222222222222222222")

# 3. Filter: Female smokers who dined on weekends and gave tips over $4
female_weekend_smokers = df[
    (df['sex'] == 'Female') &
    (df['smoker'] == 'Yes') &
    (df['day'].isin(['Sat', 'Sun'])) &
    (df['tip'] > 4)
]
print("\n3. Female smokers on weekend who tipped over $4:")
print(female_weekend_smokers.head())
print("33333333333333333333333333")

# 4. Filter: Tables with size >= 4 but average tip per person < $1.5
df['tip_per_person'] = df['tip'] / df['size']
low_tip_big_tables = df[(df['size'] >= 4) & (df['tip_per_person'] < 1.5)]
print("\n4. Large tables (>=4) but low average tip per person (<$1.5):")
print(low_tip_big_tables.head())
print("444444444444444444444444")

# 5. Filter: Bills where the cents value is close to 0.99 (i.e., total_bill ends in .99)
rounded_bills = df[df['total_bill'].apply(lambda x: str(x).endswith('99'))]
print("\n5. Bills ending in .99:")
print(rounded_bills.head())

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4
5       25.29  4.71    Male     No  Sun  Dinner     4
6        8.77  2.00    Male     No  Sun  Dinner     2
7       26.88  3.12    Male     No  Sun  Dinner     4
8       15.04  1.96    Male     No  Sun  Dinner     2
9       14.78  3.23    Male     No  Sun  Dinner     2
0000000000000000000000000

1. Tipped more than 20% of total bill:
    total_bill   tip     sex smoker  day    time  size  tip_percent
6         8.77  2.00    Male     No  Sun  Dinner     2    22.805017
9        14.78  3.23    Male     No  Sun  Dinner     2    21.853857
14       14.83  3.02  Female     No  Sun  Dinner     2    20.364127
17       16.29  3.71    Male     No  Sun  Dinner     3    22.774708
18       16.97  3.50  Female     No  Sun  Dinner     3    20.624632
111111111111111111111111111

2. Lunch time male customers with total bill between $15 and $30:
    total_bill   tip   sex smoker   day   time  size  tip_percent
77       27.20  4.00  Male     No  Thur  Lunch     4    14.705882
78       22.76  3.00  Male     No  Thur  Lunch     2    13.181019
79       17.29  2.71  Male     No  Thur  Lunch     2    15.673800
80       19.44  3.00  Male    Yes  Thur  Lunch     2    15.432099
81       16.66  3.40  Male     No  Thur  Lunch     2    20.408163
2222222222222222222222222222

3. Female smokers on weekend who tipped over $4:
     total_bill  tip     sex smoker  day    time  size  tip_percent
73        25.28  5.0  Female    Yes  Sat  Dinner     2    19.778481
214       28.17  6.5  Female    Yes  Sat  Dinner     3    23.074192
33333333333333333333333333

4. Large tables (>=4) but low average tip per person (<$1.5):
    total_bill   tip     sex smoker  day    time  size  tip_percent  \
4        24.59  3.61  Female     No  Sun  Dinner     4    14.680765
5        25.29  4.71    Male     No  Sun  Dinner     4    18.623962
7        26.88  3.12    Male     No  Sun  Dinner     4    11.607143
11       35.26  5.00  Female     No  Sun  Dinner     4    14.180374
13       18.43  3.00    Male     No  Sun  Dinner     4    16.277808

    tip_per_person
4           0.9025
5           1.1775
7           0.7800
11          1.2500
13          0.7500
444444444444444444444444

5. Bills ending in .99:
   total_bill   tip     sex smoker  day    time  size  tip_percent  \
0       16.99  1.01  Female     No  Sun  Dinner     2     5.944673

   tip_per_person
0           0.505

###  groupby and aggregation

In [3]:
# Example 1
# Sample employee data
data = {
    'Department': ['HR', 'IT', 'Finance', 'HR', 'IT', 'Finance', 'HR', 'IT', 'Finance'],
    'Employee': ['Rahim', 'Vanessa', 'Cory', 'David', 'Neha', 'Frank', 'Grace', 'Helen', 'Ian'],
    'Salary': [60000, 75000, 82000, 58000, 79000, 91000, 62000, 73000, 88000],
    'Experience': [2, 5, 7, 3, 4, 9, 2, 6, 8],
    'Region' : ['East', 'West', 'East', 'West', 'East', 'West', 'East', 'East', 'West']
}

df = pd.DataFrame(data)

print("Original Data:\n", df)
print("00000000000000000000000000")

# Group by Department
grouped_counts = df.groupby(['Department',]).size() # size() total rows in each group: Includes NaN values
print(grouped_counts)
print("1111111111111111111111111111")
grouped_counts = df.groupby(['Department',]).count() # count() would give total of non-null in each group
print(grouped_counts)
print("1111111111111111111111111111")


# Group by Region
grouped_counts = df.groupby(['Region',]).size()
print(grouped_counts)
print("22222222222222222222222")

# Group by Department and Region
grouped_counts = df.groupby(['Department', 'Region']).size()
print(grouped_counts)
print("33333333333333333333333333")

# Group by department and calculate average salary
avg_salary = df.groupby('Department')['Salary'].mean()
print("\nAverage Salary by Department:\n", avg_salary)
print("44444444444444444444444444")


# Group by department and calculate total experience
total_exp = df.groupby('Department')['Experience'].sum()
print("\nTotal Experience by Department:\n", total_exp)
print("555555555555555555555555555")


# Group by multiple columns
grouped = df.groupby(['Department', 'Region'])['Salary'].mean()
print("\nAverage Salary by Department and Region:\n", grouped)


# (SKIP: OPTIONAL)Get the group for a particular key
# hr_group = df.groupby('Department').get_group('HR')
# print("\nAll Employees in HR:\n", hr_group)


# Iterate over groups
print("\nIterating through groups:")
grouped = df.groupby('Department')
for name, group in grouped:
    print(f"\nDepartment: {name}")
    print(group)

#### Aggregation
# (SKIP: OPTIONAL)Group by department and get multiple stats
multi_stats = df.groupby('Department').agg({
    'Salary': ['mean', 'max', 'min'],
    'Experience': ['mean', 'count']
})
print("\nMultiple Aggregations by Department:\n", multi_stats)

Original Data:
   Department Employee  Salary  Experience Region
0         HR    Rahim   60000           2   East
1         IT  Vanessa   75000           5   West
2    Finance     Cory   82000           7   East
3         HR    David   58000           3   West
4         IT     Neha   79000           4   East
5    Finance    Frank   91000           9   West
6         HR    Grace   62000           2   East
7         IT    Helen   73000           6   East
8    Finance      Ian   88000           8   West
00000000000000000000000000
Department
Finance    3
HR         3
IT         3
dtype: int64
1111111111111111111111111111
            Employee  Salary  Experience  Region
Department
Finance            3       3           3       3
HR                 3       3           3       3
IT                 3       3           3       3
1111111111111111111111111111
Region
East    5
West    4
dtype: int64
22222222222222222222222
Department  Region
Finance     East      1
            West      2
HR          East      2
            West      1
IT          East      2
            West      1
dtype: int64
33333333333333333333333333

Average Salary by Department:
 Department
Finance    87000.000000
HR         60000.000000
IT         75666.666667
Name: Salary, dtype: float64
44444444444444444444444444

Total Experience by Department:
 Department
Finance    24
HR          7
IT         15
Name: Experience, dtype: int64
555555555555555555555555555

Average Salary by Department and Region:
 Department  Region
Finance     East      82000.0
            West      89500.0
HR          East      61000.0
            West      58000.0
IT          East      76000.0
            West      75000.0
Name: Salary, dtype: float64

Iterating through groups:

Department: Finance
  Department Employee  Salary  Experience Region
2    Finance     Cory   82000           7   East
5    Finance    Frank   91000           9   West
8    Finance      Ian   88000           8   West

Department: HR
  Department Employee  Salary  Experience Region
0         HR    Rahim   60000           2   East
3         HR    David   58000           3   West
6         HR    Grace   62000           2   East

Department: IT
  Department Employee  Salary  Experience Region
1         IT  Vanessa   75000           5   West
4         IT     Neha   79000           4   East
7         IT    Helen   73000           6   East

Multiple Aggregations by Department:
                   Salary               Experience
                    mean    max    min       mean count
Department
Finance     87000.000000  91000  82000   8.000000     3
HR          60000.000000  62000  58000   2.333333     3
IT          75666.666667  79000  73000   5.000000     3

In [9]:
# Example 2

df = pd.read_csv('https://raw.githubusercontent.com/ash322ash422/tut_pandas_numpy/refs/heads/master/titanic.csv', sep=',')
print(df.head(5))
print("111111111111111111111111")

print(df.groupby('Sex').count())
print("222222222222222222222222")

print(df.groupby('Sex')['Fare'].mean()) # .mean() for 'Fare' gives the average fare paid by male vs. female passengers.
print("333333333333333333333333")

########### Aggregation #####################
df.groupby('Sex').agg({
    'Fare': ['mean', 'median', 'max', 'min'],
    'Survived': 'mean'
})

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S
111111111111111111111111
        PassengerId  Survived  Pclass  Name  Age  SibSp  Parch  Ticket  Fare  \
Sex
female          314       314     314   314  261    314    314     314   314
male            577       577     577   577  453    577    577     577   577

        Cabin  Embarked
Sex
female     97       312
male      107       577
222222222222222222222222
Sex
female    44.479818
male      25.523893
Name: Fare, dtype: float64
333333333333333333333333

             Fare                         Survived
             mean median       max   min      mean
Sex
female  44.479818   23.0  512.3292  6.75  0.742038
male    25.523893   10.5  512.3292  0.00  0.188908

In [7]:
# example 3
import seaborn as sns

df = sns.load_dataset("tips")
print(df.head(10))
print("00000000000000000000")

print(df.groupby(['day'], observed=False).size())
print("1111111111111111111111")

print(df.groupby(['time'], observed=False).size())
print("222222222222222222222")

# Group by 'day' and 'time' to see how many entries there are
print(df.groupby(['day', 'time'], observed=False).size())
print("33333333333333333333")

print(df.groupby(['day', 'time'], observed=False)['tip'].describe())
print("44444444444444444444444444")

#################################################
########### Aggregation #####################
tip_by_day = df.groupby('day').agg({
    'tip': ['mean', 'max', 'min', 'count']
}).reset_index()

tip_by_day.columns = ['Day', 'Avg_Tip', 'Max_Tip', 'Min_Tip', 'Count']
print(tip_by_day)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4
5       25.29  4.71    Male     No  Sun  Dinner     4
6        8.77  2.00    Male     No  Sun  Dinner     2
7       26.88  3.12    Male     No  Sun  Dinner     4
8       15.04  1.96    Male     No  Sun  Dinner     2
9       14.78  3.23    Male     No  Sun  Dinner     2
00000000000000000000
day
Thur    62
Fri     19
Sat     87
Sun     76
dtype: int64
1111111111111111111111
time
Lunch      68
Dinner    176
dtype: int64
222222222222222222222
day   time
Thur  Lunch     61
      Dinner     1
Fri   Lunch      7
      Dinner    12
Sat   Lunch      0
      Dinner    87
Sun   Lunch      0
      Dinner    76
dtype: int64
33333333333333333333
             count      mean       std   min     25%   50%    75%    max
day  time
Thur Lunch    61.0  2.767705  1.250162  1.25  2.0000  2.30  3.400   6.70
     Dinner    1.0  3.000000       NaN  3.00  3.0000  3.00  3.000   3.00
Fri  Lunch     7.0  2.382857  0.662966  1.58  1.9600  2.20  2.750   3.48
     Dinner   12.0  2.940000  1.156098  1.00  2.2500  3.00  3.625   4.73
Sat  Dinner   87.0  2.993103  1.631014  1.00  2.0000  2.75  3.370  10.00
Sun  Dinner   76.0  3.255132  1.234880  1.01  2.0375  3.15  4.000   6.50
44444444444444444444444444
    Day   Avg_Tip  Max_Tip  Min_Tip  Count
0  Thur  2.771452     6.70     1.25     62
1   Fri  2.734737     4.73     1.00     19
2   Sat  2.993103    10.00     1.00     87
3   Sun  3.255132     6.50     1.01     76

In [30]:
# example 4
# tips_groupby_examples.py

# Load the tips dataset
df = sns.load_dataset("tips")
print(df.head(10))

# 1. Average tip by day
avg_tip_by_day = df.groupby("day")["tip"].mean()
print("\n1. Average tip by day:")
print(avg_tip_by_day)
print("1111111111111111111111")

# 2. Total bill and tip by smoker vs non-smoker
total_by_smoker = df.groupby("smoker")[["total_bill", "tip"]].sum()
print("\n2. Total bill and tip (Smoker vs Non-Smoker):")
print(total_by_smoker)

# 3. Tip percentage by gender
df['tip_pct'] = df['tip'] / df['total_bill']
avg_tip_pct_by_sex = df.groupby("sex")["tip_pct"].mean()
print("\n3. Average tip percentage by gender:")
print(avg_tip_pct_by_sex)

# 4. Median tip by day and time (multi-index group)
median_tip_by_day_time = df.groupby(["day", "time"])["tip"].median()
print("\n4. Median tip by day and time:")
print(median_tip_by_day_time)


### Aggregation
# 5. Group by table size and find count, average total_bill, and max tip
stats_by_size = df.groupby("size").agg({
    "total_bill": "mean",
    "tip": "max",
    "sex": "count"  # Just to see how many entries per group
}).rename(columns={"sex": "count"})
print("\n5. Stats by table size (count, average total bill, max tip):")
print(stats_by_size)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4
5       25.29  4.71    Male     No  Sun  Dinner     4
6        8.77  2.00    Male     No  Sun  Dinner     2
7       26.88  3.12    Male     No  Sun  Dinner     4
8       15.04  1.96    Male     No  Sun  Dinner     2
9       14.78  3.23    Male     No  Sun  Dinner     2

1. Average tip by day:
day
Thur    2.771452
Fri     2.734737
Sat     2.993103
Sun     3.255132
Name: tip, dtype: float64
1111111111111111111111

2. Total bill and tip (Smoker vs Non-Smoker):
        total_bill     tip
smoker
Yes        1930.34  279.81
No         2897.43  451.77

3. Average tip percentage by gender:
sex
Male      0.157651
Female    0.166491
Name: tip_pct, dtype: float64

4. Median tip by day and time:
day   time
Thur  Lunch     2.30
      Dinner    3.00
Fri   Lunch     2.20
      Dinner    3.00
Sat   Lunch      NaN
      Dinner    2.75
Sun   Lunch      NaN
      Dinner    3.15
Name: tip, dtype: float64

5. Stats by table size (count, average total bill, max tip):
      total_bill    tip  count
size
1       7.242500   1.92      4
2      16.448013   5.85    156
3      23.277632  10.00     38
4      28.613514   9.00     37
5      30.068000   5.14      5
6      34.830000   6.70      4

## [concat](https://pandas.pydata.org/docs/user_guide/merging.html)
Taken from a good source: [concat](https://pandas.pydata.org/docs/user_guide/merging.html) Look here for visual

[concat](https://pandas.pydata.org/docs/user_guide/merging.html#concat)

In [31]:
df1 = pd.DataFrame(
 {
 "A": ["A0", "A1", "A2", "A3"],
 "B": ["B0", "B1", "B2", "B3"],
 "C": ["C0", "C1", "C2", "C3"],
 "D": ["D0", "D1", "D2", "D3"],
 },
 index=[0, 1, 2, 3],
)

df2 = pd.DataFrame(
 {
 "A": ["A4", "A5", "A6", "A7"],
 "B": ["B4", "B5", "B6", "B7"],
 "C": ["C4", "C5", "C6", "C7"],
 "D": ["D4", "D5", "D6", "D7"],
 },
 index=[4, 5, 6, 7],
 )

df3 = pd.DataFrame(
 {
 "A": ["A8", "A9", "A10", "A11"],
 "B": ["B8", "B9", "B10", "B11"],
 "C": ["C8", "C9", "C10", "C11"],
 "D": ["D8", "D9", "D10", "D11"],
 },
 index=[8, 9, 10, 11],
)

frames = [df1, df2, df3]

result =  pd.concat(frames)
print(result)

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [32]:
# Joining logic of the resulting axis
df4 = pd.DataFrame(
   {
       "B": ["B2", "B3", "B6", "B7"],
       "D": ["D2", "D3", "D6", "D7"],
       "F": ["F2", "F3", "F6", "F7"],
   },
   index=[2, 3, 6, 7],
)
result = pd.concat([df1, df4], axis=1)
print(result)

     A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

In [33]:
# join='inner' takes the intersection of the axis values
result = pd.concat([df1, df4], axis=1, join="inner")
print(result)

    A   B   C   D   B   D   F
2  A2  B2  C2  D2  B2  D2  F2
3  A3  B3  C3  D3  B3  D3  F3

In [34]:
# To perform an effective “left” join using the exact index from the original DataFrame, result can be reindexed.
result = pd.concat([df1, df4], axis=1).reindex(df1.index)
print(result)

    A   B   C   D    B    D    F
0  A0  B0  C0  D0  NaN  NaN  NaN
1  A1  B1  C1  D1  NaN  NaN  NaN
2  A2  B2  C2  D2   B2   D2   F2
3  A3  B3  C3  D3   B3   D3   F3

In [35]:
# Ignoring indexes on the concatenation axis
# For DataFrame objects which don’t have a meaningful index, the ignore_index ignores overlapping indexes.

result = pd.concat([df1, df4], ignore_index=True, sort=False)
print(result)

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
4  NaN  B2  NaN  D2   F2
5  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

## merge: [merge](https://pandas.pydata.org/docs/user_guide/merging.html#merge)

For a **many-to-many** join, if a key combination appears
more than once in both tables, the :class:`DataFrame` will have the **Cartesian
product** of the associated data.

In [36]:
left = pd.DataFrame(
   {
       "key": ["K0", "K1", "K2", "K3"],
       "A": ["A0", "A1", "A2", "A3"],
       "B": ["B0", "B1", "B2", "B3"],
   }
)

right = pd.DataFrame(
   {
       "key": ["K0", "K1", "K2", "K3"],
       "C": ["C0", "C1", "C2", "C3"],
       "D": ["D0", "D1", "D2", "D3"],
   }
)
result = pd.merge(left, right, on="key")
print(result)

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

## Join: [join](https://pandas.pydata.org/docs/user_guide/merging.html#dataframe-join)

In [37]:
left = pd.DataFrame(
 {"A": ["A0", "A1", "A2"], "B": ["B0", "B1", "B2"]}, index=["K0", "K1", "K2"]
)

right = pd.DataFrame(
   {"C": ["C0", "C2", "C3"], "D": ["D0", "D2", "D3"]}, index=["K0", "K2", "K3"]
 )

result = left.join(right)

print(result)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [38]:
## ignore the rest